# Львів: Межує з Луцьком, Рівним, Тернополем, Івано-Франківськом та Ужгородом.
# Ужгород: Межує з Львовом та Івано-Франківськом.
# Івано-Франківськ: Межує з Львовом, Чернівцями, Тернополем та Ужгородом.
# Тернопіль: Межує з Львовом, Рівним, Хмельницьким, Вінницею та Івано-Франківськом.
# Луцьк: Межує з Рівним та Львовом.
# Рівне: Межує з Луцьком, Львовом, Тернополем, Хмельницьким та Житомиром.
# Чернівці: Межує з Івано-Франківськом та Хмельницьким.
# Київ: Межує з Житомиром, Черніговом, Сумами, Полтавою, Черкасами та Вінницею.
# Вінниця: Межує з Житомиром, Києвом, Черкасами, Кропивницьким, Одесою, Хмельницьким та Тернополем.
# Хмельницький: Межує з Тернополем, Рівним, Чернівцями, Вінницею та Житомиром.
# Житомир: Межує з Києвом, Вінницею, Хмельницьким, Рівним та Черніговом.
# Черкаси: Межує з Києвом, Вінницею, Кропивницьким, Полтавою та Черніговом.
# Кропивницький: Межує з Вінницею, Черкасами, Полтавою, Дніпром, Миколаєвом та Одесою.
# Чернігів: Межує з Києвом, Сумами та Черкасами.
# Суми: Межує з Черніговом, Києвом, Полтавою та Харковом.
# Полтава: Межує з Києвом, Сумами, Харковом, Дніпром, Кропивницьким та Черкасами.
# Харків: Межує з Сумами, Полтавою, Дніпром, Донецьком та Луганськом.
# Дніпро: Межує з Полтавою, Харковом, Донецьком, Запоріжжям, Херсоном, Миколаєвом та Кропивницьким.
# Запоріжжя: Межує з Дніпром, Донецьком та Херсоном.
# Донецьк: Межує з Харковом, Луганськом, Запоріжжям та Дніпром.
# Луганськ: Межує з Харковом та Донецьком.
# Одеса: Межує з Вінницею, Кропивницьким, Миколаєвом та Херсоном.
# Миколаїв: Межує з Кропивницьким, Одесою, Херсоном та Дніпром.
# Херсон: Межує з Одесою, Миколаєвом, Дніпром, Запоріжжям та Сімферополем.
# Сімферополь: Межує з Херсоном.

cities_graph = {
    "Івано-Франківськ": {"Львів": 132, "Тернопіль": 113, "Ужгород": 178, "Чернівці": 132},
    "Вінниця": {"Житомир": 128, "Київ": 268, "Кропивницький": 192, "Одеса": 424, "Тернопіль": 211, "Хмельницький": 120, "Черкаси": 192},
    "Дніпро": {"Донецьк": 240, "Запоріжжя": 85, "Кропивницький": 245, "Миколаїв": 240, "Полтава": 172, "Харків": 216, "Херсон": 212},
    "Донецьк": {"Дніпро": 240, "Запоріжжя": 234, "Луганськ": 148, "Харків": 308},
    "Житомир": {"Вінниця": 128, "Київ": 140, "Рівне": 188, "Хмельницький": 168, "Чернігів": 218},
    "Запоріжжя": {"Дніпро": 85, "Донецьк": 234, "Херсон": 197},
    "Київ": {"Вінниця": 268, "Житомир": 140, "Полтава": 343, "Суми": 331, "Черкаси": 192, "Чернігів": 148},
    "Кропивницький": {"Вінниця": 192, "Дніпро": 245, "Миколаїв": 218, "Одеса": 297, "Полтава": 178, "Черкаси": 129},
    "Луганськ": {"Донецьк": 148, "Харків": 291},
    "Луцьк": {"Львів": 155, "Рівне": 72},
    "Львів": {"Івано-Франківськ": 132, "Луцьк": 155, "Рівне": 210, "Тернопіль": 127, "Ужгород": 269},
    "Миколаїв": {"Дніпро": 240, "Кропивницький": 218, "Одеса": 132, "Херсон": 61},
    "Одеса": {"Вінниця": 424, "Кропивницький": 297, "Миколаїв": 132, "Херсон": 197},
    "Полтава": {"Дніпро": 172, "Київ": 343, "Кропивницький": 178, "Суми": 184, "Харків": 143, "Черкаси": 171},
    "Рівне": {"Житомир": 188, "Луцьк": 72, "Львів": 210, "Тернопіль": 159, "Хмельницький": 132},
    "Суми": {"Київ": 331, "Полтава": 184, "Харків": 183, "Чернігів": 257},
    "Сімферополь": {"Херсон": 278},
    "Тернопіль": {"Івано-Франківськ": 113, "Вінниця": 211, "Львів": 127, "Рівне": 159, "Хмельницький": 111},
    "Ужгород": {"Івано-Франківськ": 178, "Львів": 269},
    "Харків": {"Дніпро": 216, "Донецьк": 308, "Луганськ": 291, "Полтава": 143, "Суми": 183},
    "Херсон": {"Дніпро": 212, "Запоріжжя": 197, "Миколаїв": 61, "Одеса": 197, "Сімферополь": 278},
    "Хмельницький": {"Вінниця": 120, "Житомир": 168, "Рівне": 132, "Тернопіль": 111, "Чернівці": 178},
    "Черкаси": {"Вінниця": 192, "Київ": 192, "Кропивницький": 129, "Полтава": 171, "Чернігів": 237},
    "Чернівці": {"Івано-Франківськ": 132, "Хмельницький": 178},
    "Чернігів": {"Київ": 148, "Суми": 257, "Черкаси": 237},
}
